###############################################################################
# Created by write_sdc
# Fri May 23 11:22:29 2025
###############################################################################
current_design ZeroToFiveCounter
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 10.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {core_clock}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
